; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	image0 - mode
	image2 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation14 - direction
	GroundStation13 - direction
	Star7 - direction
	GroundStation2 - direction
	Star5 - direction
	Star11 - direction
	GroundStation6 - direction
	GroundStation12 - direction
	GroundStation0 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 image0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation13)
	(supports instrument3 infrared1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation12)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star5)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star19)
)
(:goal (and
	(have_image Planet15 image2)
	(have_image Star16 image0)
	(have_image Planet17 infrared1)
	(have_image Star18 image2)
	(have_image Planet21 image0)
))

)

; plan
1. (turn_to satellite1 groundstation1 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 planet17 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet17)
   goals met: 0 of 5
5. (take_image satellite1 planet17 instrument2 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 1 of 5
6. (turn_to satellite1 planet15 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet15)
   goals met: 1 of 5
7. (take_image satellite1 planet15 instrument2 image2)
   added: (have_image planet15 image2)
   goals met: 2 of 5
8. (turn_to satellite1 planet21 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet21)
   goals met: 2 of 5
9. (take_image satellite1 planet21 instrument2 image0)
   added: (have_image planet21 image0)
   goals met: 3 of 5
10. (turn_to satellite1 star16 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star16)
   goals met: 3 of 5
11. (take_image satellite1 star16 instrument2 image0)
   added: (have_image star16 image0)
   goals met: 4 of 5
12. (turn_to satellite1 star18 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star18)
   goals met: 4 of 5
13. (take_image satellite1 star18 instrument2 image2)
   added: (have_image star18 image2)
   goals met: 5 of 5
